app/Models/Dashboard/DashboardModel.php

  public function getTotalDosen() {
    $getQuery   = $this->db->table('user');
    $resultData = $getQuery->getWhere(['rules' => 3])->getResult();
---
SELECT *
FROM `user`
WHERE `rules` = 3

  public function getTotalMahasiswa() {
    $getQuery   = $this->db->table('user');
    $resultData = $getQuery->getWhere(['rules' => 5])->getResult();
---
SELECT *
FROM `user`
WHERE `rules` = 5

  public function getTotalUser() {
    $getQuery   = $this->db->table('user');
    $resultData = $getQuery->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`