app/Models/SuratTugas/SuratTugasModel.php

SELECT *
FROM `surat_tugas`
WHERE `assigment_to_user_id` = '5'
ORDER BY `id` DESC
 LIMIT 10
---
  public function getDatatables(){
    $this->getDatatablesQuery();
    if ($this->request->getPost('length') != -1) $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));

    /** Administrator */
    if ($this->session->user_logged['rules'] == '1') {
      $query = $this->dt->get();
    }

    /** Admin TU */
    if ($this->session->user_logged['rules'] == '2') {
      $query = $this->dt->getWhere(['assigment_to_user_id' => $this->session->user_logged['id']]);
    }

    /** Dosen */
    if ($this->session->user_logged['rules'] == '3') {
      $query = $this->dt->getWhere(['assigment_to_user_id' => $this->session->user_logged['id']]);
    }

    /** Kaprodi */
    if ($this->session->user_logged['rules'] == '4') {
      $query = $this->dt->get();
    }

    /** Mahasiswa */
    if ($this->session->user_logged['rules'] == '5') {
      $query = $this->dt->getWhere(['assigment_to_user_id' => $this->session->user_logged['id']]);

SELECT COUNT(*) AS `numrows`
FROM `surat_tugas`
---
  public function countFiltered() {
    $this->getDatatablesQuery();
    return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `surat_tugas`
---
  public function countAll() {
    $tbl_storage = $this->db->table($this->table);
    return $tbl_storage->countAllResults();

SELECT *
FROM `user`
WHERE `id` = '5'
---
  public function getUserData($id) {
    $_id = $this->classesModel->decrypter($id);

    $getQuery = $this->db->table('user');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere(['id' => $_id])->getRowArray();

SELECT *
FROM `formulir_uji_kelayakan`
WHERE `nim` = '2023000123'
---
  public function getDataFormUjiKelayakanByNim($nim) {
    $_nim = $this->classesModel->decrypter($nim);

    $getQuery = $this->db->table('formulir_uji_kelayakan');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere(['nim' => $_nim])->getRowArray();

SELECT *
FROM `penilaian_uji_kelayakan`
WHERE `uji_kelayakan_id` = '1'
AND `mahasiswa_id` = '5'
SELECT COUNT(*) AS `numrows` FROM `penilaian_uji_kelayakan`
---
  public function checkDataHasilForMahasiswa($mahasiswa_id, $uji_kelayakan_id) {
    $mahasiswa_id = $this->classesModel->decrypter($mahasiswa_id);
    $uji_kelayakan_id = $this->classesModel->decrypter($uji_kelayakan_id);

    $getQuery = $this->db->table('penilaian_uji_kelayakan');
    $getQuery->select('*');
    $getQuery->getWhere([
      'uji_kelayakan_id' => $uji_kelayakan_id,
      'mahasiswa_id' => $mahasiswa_id
    ]);

    $valid = ($getQuery->countAll() > 0) ? true : false;

SELECT *
FROM `penilaian_uji_kelayakan`
WHERE `uji_kelayakan_id` = '1'
AND `mahasiswa_id` = '5'
---
  public function getDataHasilPenilaianForMahasiswa($mahasiswa_id, $uji_kelayakan_id) {
    $mahasiswa_id = $this->classesModel->decrypter($mahasiswa_id);
    $uji_kelayakan_id = $this->classesModel->decrypter($uji_kelayakan_id);

    $getQuery = $this->db->table('penilaian_uji_kelayakan');
    $getQuery->select('*');
    $result = $getQuery->getWhere([
      'uji_kelayakan_id' => $uji_kelayakan_id,
      'mahasiswa_id' => $mahasiswa_id
    ])->getResult();