app/Models/SuratTugas/SuratTugasPembimbingModel.php

  public function getUserData($id) {
    $_id = $this->classesModel->decrypter($id);

    $getQuery = $this->db->table('user');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere(['id' => $_id])->getRowArray();
---
SELECT *
FROM `user`
WHERE `id` = '5'

  public function getDataFormUjiKelayakanByNim($nim) {
    $_nim = $this->classesModel->decrypter($nim);

    $getQuery = $this->db->table('formulir_uji_kelayakan');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere(['nim' => $_nim])->getRowArray();
---
SELECT *
FROM `formulir_uji_kelayakan`
WHERE `nim` = '2023000123'

  public function checkDataHasilForMahasiswa($mahasiswa_id, $uji_kelayakan_id) {
    $mahasiswa_id = $this->classesModel->decrypter($mahasiswa_id);
    $uji_kelayakan_id = $this->classesModel->decrypter($uji_kelayakan_id);

    $getQuery = $this->db->table('penilaian_uji_kelayakan');
    $getQuery->select('*');
    $getQuery->getWhere([
      'uji_kelayakan_id' => $uji_kelayakan_id,
      'mahasiswa_id' => $mahasiswa_id
    ]);

    $valid = ($getQuery->countAll() > 0) ? true : false;
---
SELECT *
FROM `penilaian_uji_kelayakan`
WHERE `uji_kelayakan_id` = '1'
AND `mahasiswa_id` = '5'
SELECT COUNT(*) AS `numrows` FROM `penilaian_uji_kelayakan`