app/Models/JadwalSidang/JadwalSidangSkripsiModel.php

SELECT *
FROM `formulir_skripsi`
WHERE `id` = '1'
---
  public function getById($id) {
    $ids = $this->classesModel->decrypter($id);

    $getQuery = $this->db->table('formulir_skripsi');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere(['id' => $ids])->getRowArray();

SELECT *
FROM `formulir_uji_kelayakan`
WHERE `nim` = '2023000123'
AND `status` = '7'
SELECT *
FROM `penugasan_dosen_pembimbing_uji_kelayakan_judul`
WHERE `formulir_uji_kelayakan_id` = '1'
AND `status` = '2'
---
  public function getDosPembUjiKelayakanByNimStatusSelesai($nim) {
    $getQuery = $this->db->table('formulir_uji_kelayakan');
    $getQuery->select('*');
    $resultDataFormUjiKelayakan = $getQuery->getWhere([
      'nim' => $nim,
      'status' => '7'
    ])->getRowArray();

    $ujiKelayakanId = $resultDataFormUjiKelayakan['id'];

    $sql = $this->db->table('penugasan_dosen_pembimbing_uji_kelayakan_judul');
    $sql->select('*');
    $resultDataDosPemUjiKelayakan = $sql->getWhere([
      'formulir_uji_kelayakan_id' => $ujiKelayakanId,
      'status' => '2'
    ])->getResult();

SELECT *
FROM `user`
WHERE `id` = '12'
---
  private function getUserDataById($id) {
    $getQuery   = $this->db->table('user');
    $resultData = $getQuery->getWhere(['id' => $id])->getRowArray();

SELECT *
FROM `penugasan_dosen_penguji_skripsi`
WHERE `formulir_skripsi_id` = '1'
---
  public function getDosPembSkripsi($formulir_id) {
    $getQuery = $this->db->table('penugasan_dosen_penguji_skripsi');
    $getQuery->select('*');
    $resultDataDospemSkripsi = $getQuery->getWhere([
      'formulir_skripsi_id' => $formulir_id
    ])->getResult();

SELECT *
FROM `input_nilai`
WHERE `mahasiswa_id` = '5'
AND `input_jadwal_type` = 'skripsi'
---
  public function getStatusKesimpulan($input_jadwal_id, $mahasiswa_id) {
    $input_jadwal_id = $this->classesModel->decrypter($input_jadwal_id);
    $mahasiswa_id = $this->classesModel->decrypter($mahasiswa_id);

    $getQuery = $this->db->table('input_nilai');
    $getQuery->select('*');
    $resultData = $getQuery->getWhere([
      'mahasiswa_id' => $mahasiswa_id,
      'input_jadwal_type' => 'skripsi'
    ])->getResult();