app/Models/JadwalSidang/JadwalSidangModel.php

SELECT *
FROM `user`
WHERE `id` = '5'
---
  public function getUserDataById($id) {
    $getQuery   = $this->db->table('user');
    $resultData = $getQuery->getWhere(['id' => $id])->getRowArray();