app/Models/InputNamaDosenPembimbing/InputNamaDosenPembimbingModel.php

SELECT `id`, `full_name`
FROM `user`
WHERE `rules` = 3
---
  public function getAllDosenListData() {
    $getQuery   = $this->db->table('user');
    $getQuery->select('id, full_name');
    $resultData = $getQuery->getWhere(['rules' => 3])->getResult();